output/makefile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-17 Sun 22:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MakeFile</title>
<meta name="author" content="Ram Sharan Rimal  " />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">MakeFile</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgeabdfb6">1. MakeFile</a>
<ul>
<li><a href="#org299fd36">1.1. Preparing and running make</a></li>
<li><a href="#org1217128">1.2. Introduction to Makefile</a>
<ul>
<li><a href="#org7b64b16">1.2.1. Target</a></li>
<li><a href="#orgd27a989">1.2.2. Prequisite:</a></li>
<li><a href="#orgd610c76">1.2.3. Recipe:</a></li>
</ul>
</li>
<li><a href="#org643520b">1.3. Simple MakeFile</a></li>
<li><a href="#orgaf4c455">1.4. Variables in make file</a></li>
<li><a href="#org4347ecc">1.5. Letting make Deduce the Recipes</a></li>
<li><a href="#org9b28916">1.6. Yet more few lines of code</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgeabdfb6" class="outline-2">
<h2 id="orgeabdfb6"><span class="section-number-2">1.</span> MakeFile</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>this determines which of part of the larger program is to be recompiled
and issues commands to recompile them.</li>
<li>make can be used with any programming language whose compiler can be run
with a shell command.</li>
<li>it can also be used to describe any task where some file is to be updated
automatically when there is change in another file.</li>
</ul>
</div>

<div id="outline-container-org299fd36" class="outline-3">
<h3 id="org299fd36"><span class="section-number-3">1.1.</span> Preparing and running make</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>to prepare to use make , a file called makefile that describes the relationship
among the files in program and commands  how to update each files.</li>
<li>Typically in a program, executable file is updated from object file, which
in turn are made by compiling the source file.</li>
<li>the simple shell command <b><b>make</b></b> is  used to run the makefile</li>
<li>The make program uses the makefile database and the last modification times
of the files to decide which of the file is to be updated.</li>
<li>Also it issues the  recipes recorded in the database.</li>
</ul>
</div>
</div>


<div id="outline-container-org1217128" class="outline-3">
<h3 id="org1217128"><span class="section-number-3">1.2.</span> Introduction to Makefile</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Makefile tells make how to compile and link a program.</li>
<li>When make recompiles the editor , each file must be recompiled.</li>
<li>If a header file is changed then, each file sourcing this header is to be
recompiled.</li>
<li>And the files are to be freshly linked to make a working executable.</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">target.. : prerequisites ...
           recipe
           ...
           ...
</pre>
</div>
</div>
<div id="outline-container-org7b64b16" class="outline-4">
<h4 id="org7b64b16"><span class="section-number-4">1.2.1.</span> Target</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>target is usually the file generated by the program.</li>
<li>Example : executable or object files.</li>
<li>Target also can be the action <b><b>clean</b></b> to be carried out.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd27a989" class="outline-4">
<h4 id="orgd27a989"><span class="section-number-4">1.2.2.</span> Prequisite:</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>This is the input used to create the target files.</li>
<li>Target usually depends on several files.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd610c76" class="outline-4">
<h4 id="orgd610c76"><span class="section-number-4">1.2.3.</span> Recipe:</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>It is the action that make carries out.</li>
<li>It can be one or more than one command, either on same line or each
on its own line.</li>
<li><b><b>There is a tab character at the begining of every receipe line !</b></b></li>
<li>If you want to prefix your receipes with a specific character other then
it is to be specified in the .RECIPEPREFIX variable to an alternate character.</li>
<li>If any of the pre req changes then the target files are changed with the
recipe and the prerequisites.</li>
<li>pre req is not to be necessarialy attached to the recipe, example for
<b><b>clean</b></b> <b><b>delete</b></b> there is no pre req required.</li>
<li>Recipe contains the rule for recompiling.</li>
<li>A rule then explains how and when to recompile the pre req to reach the target.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org643520b" class="outline-3">
<h3 id="org643520b"><span class="section-number-3">1.3.</span> Simple MakeFile</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Here is a example of a make file that makes an executable <b><b>edit</b></b>  from the
eight object files which are inturn comlied from eight source files.</li>
<li>Here in the example each C files includes the defs.h</li>
<li>Also only the defining editing commands includes commands.h and only low
levels file  that changed the editor buffer  includes buffer.h</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">edit : main.o kdb.o display.o \
       insert.o search.o files.o utils.o
      cc -o edit main.o kbd.o command.o display.o\
         insert.o search.o files.o utils.o

main.o : main.c defs.h
       cc -c main.c
kbd.o  : kbd.c defs.h command.h
        cc -c kbd.c
command.o : command.c defs.h command.h
          cc -c command.c
display.o : display.c defs.h buffer.h
          cc -c display.c
insert.o : insert.c defs.h buffer.h
          cc -c insert.c
search.o : search.c defs.h buffer.h
          cc -c search.c
files.o : file.c defs.h command.h
          cc -c files.c
utils.o : utils.c defs.h
          cc -c utils.c
clean :
       rm edit main.o kbd.o command.o display.o \
          insert.o search.o files.o utils.o


</pre>
</div>

<ul class="org-ul">
<li>Here main executable is main and it is generated from the object files
each generated below.</li>
<li>\ is used to split the long lines into two lines.</li>
<li>clean is a command with no target and is used to delete executable and all
the object files.</li>
<li>each object is generated from corresponding c , header files using  `cc -c
and the c file for that object file.<br />
This is the rule for each c file to be converted to object files .</li>

<li>By default when the make file is started it tries to update the goal file
(i.e the file without .  , here edit is that file)<br />
This is the default goal of the make.</li>
<li>This can be overridden using the .DEFAULT<sub>GOAL</sub> special variable.</li>
<li>edit is the default executable program here and make file updates the edit.</li>
</ul>
</div>
</div>


<div id="outline-container-orgaf4c455" class="outline-3">
<h3 id="orgaf4c455"><span class="section-number-3">1.4.</span> Variables in make file</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-shell">objects = main.o kdb.o display.o \
       insert.o search.o files.o utils.o
edit : $(objects)
      cc -o edit $(objects)

main.o : main.c defs.h
       cc -c main.c
kbd.o  : kbd.c defs.h command.h
        cc -c kbd.c
command.o : command.c defs.h command.h
          cc -c command.c
display.o : display.c defs.h buffer.h
          cc -c display.c
insert.o : insert.c defs.h buffer.h
          cc -c insert.c
search.o : search.c defs.h buffer.h
          cc -c search.c
files.o : file.c defs.h command.h
          cc -c files.c
utils.o : utils.c defs.h
          cc -c utils.c
clean :
       rm $(objects)

</pre>
</div>
<ul class="org-ul">
<li>As seen in the above examples variables can also be used in the make file.</li>
</ul>
</div>
</div>

<div id="outline-container-org4347ecc" class="outline-3">
<h3 id="org4347ecc"><span class="section-number-3">1.5.</span> Letting make Deduce the Recipes</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>It is not necessary to define the recipe to compile the individual C source
files, because make can figure the implicit rule to generate <b><b>.o</b></b> file from
the <b><b>.c</b></b> file using  <b>*cc -c *</b> command.<br />
For example it will use  <b>*cc -c main.c -o main-o *</b>  command to
generate <b><b>main.o</b></b></li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">objects = main.o kdb.o display.o \
       insert.o search.o files.o utils.o
edit : $(objects)
      cc -o edit $(objects)

main.o : defs.h
kbd.o  : defs.h command.h
command.o :  defs.h command.h
display.o : defs.h buffer.h
insert.o : defs.h buffer.h
search.o :  defs.h buffer.h
files.o : defs.h command.h
utils.o : defs.h
clean :
       rm $(objects)

</pre>
</div>

<ul class="org-ul">
<li>Using this file also generates the <b><b>edit</b></b> program as in the first case.</li>
</ul>
</div>
</div>

<div id="outline-container-org9b28916" class="outline-3">
<h3 id="org9b28916"><span class="section-number-3">1.6.</span> Yet more few lines of code</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>If the objects of the makefile are only generated by inplicit rules then
alternative way of writing make file is also possible.</li>
<li><p>
Here group entries can be grouped together based on their prerequisites.
</p>
<div class="org-src-container">
<pre class="src src-shell">objects = main.o kdb.o display.o \
       insert.o search.o files.o utils.o
edit : $(objects)
      cc -o edit $(objects)

$(objects) : defs.h
kbd.o command.o files.o : command.h
display.o insert.o search.o files.o : buffer.h

clean :
       rm $(objects)

</pre>
</div></li>

<li>This is more compact way of writing make file.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ram Sharan Rimal  </p>
<p class="date">Created: 2024-11-17 Sun 22:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
